Tekla Open API Reference for Tekla Structures 2025
CannotDeleteActiveDrawingException Class
 The CannotDeleteActiveDrawingException class defines the exception that is thrown when a user tries to delete a drawing that is active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotDeleteActiveDrawingException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotDeleteActiveDrawingException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotDeleteActiveDrawingException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotDeleteActiveDrawingException type exposes the following members.
Constructors
Name | Description
CannotDeleteActiveDrawingException
 Creates a new cannot delete active drawing exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace